zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_adi_4_aux.h
/******************************************************************************
*  Filename:       hw_adi_4_aux_h
*  Revised:        2018-05-14 12:24:52 +0200 (Mon, 14 May 2018)
*  Revision:       51990
*
* Copyright (c) 2015 - 2017, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_ADI_4_AUX_H__
#define __HW_ADI_4_AUX_H__

//*****************************************************************************
//
// This section defines the register offsets of
// ADI_4_AUX component
//
//*****************************************************************************
// Internal
#define ADI_4_AUX_O_MUX0                                            0x00000000

// Internal
#define ADI_4_AUX_O_MUX1                                            0x00000001

// Internal
#define ADI_4_AUX_O_MUX2                                            0x00000002

// Internal
#define ADI_4_AUX_O_MUX3                                            0x00000003

// Current Source
#define ADI_4_AUX_O_ISRC                                            0x00000004

// Comparator
#define ADI_4_AUX_O_COMP                                            0x00000005

// Internal
#define ADI_4_AUX_O_MUX4                                            0x00000007

// ADC Control 0
#define ADI_4_AUX_O_ADC0                                            0x00000008

// ADC Control 1
#define ADI_4_AUX_O_ADC1                                            0x00000009

// ADC Reference 0
#define ADI_4_AUX_O_ADCREF0                                         0x0000000A

// ADC Reference 1
#define ADI_4_AUX_O_ADCREF1                                         0x0000000B

// Internal
#define ADI_4_AUX_O_LPMBIAS                                         0x0000000E

//*****************************************************************************
//
// Register: ADI_4_AUX_O_MUX0
//
//*****************************************************************************
// Field:     [6] ADCCOMPB_IN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// VDDR_1P8V                Internal. Only to be used through TI provided API.
// NC                       Internal. Only to be used through TI provided API.
#define ADI_4_AUX_MUX0_ADCCOMPB_IN                                  0x00000040
#define ADI_4_AUX_MUX0_ADCCOMPB_IN_M                                0x00000040
#define ADI_4_AUX_MUX0_ADCCOMPB_IN_S                                         6
#define ADI_4_AUX_MUX0_ADCCOMPB_IN_VDDR_1P8V                        0x00000040
#define ADI_4_AUX_MUX0_ADCCOMPB_IN_NC                               0x00000000

// Field:   [3:0] COMPA_REF
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// ADCVREFP                 Internal. Only to be used through TI provided API.
// VDDS                     Internal. Only to be used through TI provided API.
// VSS                      Internal. Only to be used through TI provided API.
// DCOUPL                   Internal. Only to be used through TI provided API.
// NC                       Internal. Only to be used through TI provided API.
#define ADI_4_AUX_MUX0_COMPA_REF_W                                           4
#define ADI_4_AUX_MUX0_COMPA_REF_M                                  0x0000000F
#define ADI_4_AUX_MUX0_COMPA_REF_S                                           0
#define ADI_4_AUX_MUX0_COMPA_REF_ADCVREFP                           0x00000008
#define ADI_4_AUX_MUX0_COMPA_REF_VDDS                               0x00000004
#define ADI_4_AUX_MUX0_COMPA_REF_VSS                                0x00000002
#define ADI_4_AUX_MUX0_COMPA_REF_DCOUPL                             0x00000001
#define ADI_4_AUX_MUX0_COMPA_REF_NC                                 0x00000000

//*****************************************************************************
//
// Register: ADI_4_AUX_O_MUX1
//
//*****************************************************************************
// Field:   [7:0] COMPA_IN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// AUXIO19                  Internal. Only to be used through TI provided API.
// AUXIO20                  Internal. Only to be used through TI provided API.
// AUXIO21                  Internal. Only to be used through TI provided API.
// AUXIO22                  Internal. Only to be used through TI provided API.
// AUXIO23                  Internal. Only to be used through TI provided API.
// AUXIO24                  Internal. Only to be used through TI provided API.
// AUXIO25                  Internal. Only to be used through TI provided API.
// AUXIO26                  Internal. Only to be used through TI provided API.
// NC                       Internal. Only to be used through TI provided API.
#define ADI_4_AUX_MUX1_COMPA_IN_W                                            8
#define ADI_4_AUX_MUX1_COMPA_IN_M                                   0x000000FF
#define ADI_4_AUX_MUX1_COMPA_IN_S                                            0
#define ADI_4_AUX_MUX1_COMPA_IN_AUXIO19                             0x00000080
#define ADI_4_AUX_MUX1_COMPA_IN_AUXIO20                             0x00000040
#define ADI_4_AUX_MUX1_COMPA_IN_AUXIO21                             0x00000020
#define ADI_4_AUX_MUX1_COMPA_IN_AUXIO22                             0x00000010
#define ADI_4_AUX_MUX1_COMPA_IN_AUXIO23                             0x00000008
#define ADI_4_AUX_MUX1_COMPA_IN_AUXIO24                             0x00000004
#define ADI_4_AUX_MUX1_COMPA_IN_AUXIO25                             0x00000002
#define ADI_4_AUX_MUX1_COMPA_IN_AUXIO26                             0x00000001
#define ADI_4_AUX_MUX1_COMPA_IN_NC                                  0x00000000

//*****************************************************************************
//
// Register: ADI_4_AUX_O_MUX2
//
//*****************************************************************************
// Field:   [7:3] ADCCOMPB_IN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// VDDS                     Internal. Only to be used through TI provided API.
// VSS                      Internal. Only to be used through TI provided API.
// DCOUPL                   Internal. Only to be used through TI provided API.
// ATEST1                   Internal. Only to be used through TI provided API.
// ATEST0                   Internal. Only to be used through TI provided API.
// NC                       Internal. Only to be used through TI provided API.
#define ADI_4_AUX_MUX2_ADCCOMPB_IN_W                                         5
#define ADI_4_AUX_MUX2_ADCCOMPB_IN_M                                0x000000F8
#define ADI_4_AUX_MUX2_ADCCOMPB_IN_S                                         3
#define ADI_4_AUX_MUX2_ADCCOMPB_IN_VDDS                             0x00000080
#define ADI_4_AUX_MUX2_ADCCOMPB_IN_VSS                              0x00000040
#define ADI_4_AUX_MUX2_ADCCOMPB_IN_DCOUPL                           0x00000020
#define ADI_4_AUX_MUX2_ADCCOMPB_IN_ATEST1                           0x00000010
#define ADI_4_AUX_MUX2_ADCCOMPB_IN_ATEST0                           0x00000008
#define ADI_4_AUX_MUX2_ADCCOMPB_IN_NC                               0x00000000

// Field:   [2:0] DAC_VREF_SEL
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// VDDS                     Internal. Only to be used through TI provided API.
// ADCREF                   Internal. Only to be used through TI provided API.
// DCOUPL                   Internal. Only to be used through TI provided API.
// NC                       Internal. Only to be used through TI provided API.
#define ADI_4_AUX_MUX2_DAC_VREF_SEL_W                                        3
#define ADI_4_AUX_MUX2_DAC_VREF_SEL_M                               0x00000007
#define ADI_4_AUX_MUX2_DAC_VREF_SEL_S                                        0
#define ADI_4_AUX_MUX2_DAC_VREF_SEL_VDDS                            0x00000004
#define ADI_4_AUX_MUX2_DAC_VREF_SEL_ADCREF                          0x00000002
#define ADI_4_AUX_MUX2_DAC_VREF_SEL_DCOUPL                          0x00000001
#define ADI_4_AUX_MUX2_DAC_VREF_SEL_NC                              0x00000000

//*****************************************************************************
//
// Register: ADI_4_AUX_O_MUX3
//
//*****************************************************************************
// Field:   [7:0] ADCCOMPB_IN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// AUXIO19                  Internal. Only to be used through TI provided API.
// AUXIO20                  Internal. Only to be used through TI provided API.
// AUXIO21                  Internal. Only to be used through TI provided API.
// AUXIO22                  Internal. Only to be used through TI provided API.
// AUXIO23                  Internal. Only to be used through TI provided API.
// AUXIO24                  Internal. Only to be used through TI provided API.
// AUXIO25                  Internal. Only to be used through TI provided API.
// AUXIO26                  Internal. Only to be used through TI provided API.
// NC                       Internal. Only to be used through TI provided API.
#define ADI_4_AUX_MUX3_ADCCOMPB_IN_W                                         8
#define ADI_4_AUX_MUX3_ADCCOMPB_IN_M                                0x000000FF
#define ADI_4_AUX_MUX3_ADCCOMPB_IN_S                                         0
#define ADI_4_AUX_MUX3_ADCCOMPB_IN_AUXIO19                          0x00000080
#define ADI_4_AUX_MUX3_ADCCOMPB_IN_AUXIO20                          0x00000040
#define ADI_4_AUX_MUX3_ADCCOMPB_IN_AUXIO21                          0x00000020
#define ADI_4_AUX_MUX3_ADCCOMPB_IN_AUXIO22                          0x00000010
#define ADI_4_AUX_MUX3_ADCCOMPB_IN_AUXIO23                          0x00000008
#define ADI_4_AUX_MUX3_ADCCOMPB_IN_AUXIO24                          0x00000004
#define ADI_4_AUX_MUX3_ADCCOMPB_IN_AUXIO25                          0x00000002
#define ADI_4_AUX_MUX3_ADCCOMPB_IN_AUXIO26                          0x00000001
#define ADI_4_AUX_MUX3_ADCCOMPB_IN_NC                               0x00000000

//*****************************************************************************
//
// Register: ADI_4_AUX_O_ISRC
//
//*****************************************************************************
// Field:   [7:2] TRIM
//
// Adjust current from current source.
//
// Output currents may be combined to get desired total current.
// ENUMs:
// 11P75U                   11.75 uA
// 4P5U                     4.5 uA
// 2P0U                     2.0 uA
// 1P0U                     1.0 uA
// 0P5U                     0.5 uA
// 0P25U                    0.25 uA
// NC                       No current connected
#define ADI_4_AUX_ISRC_TRIM_W                                                6
#define ADI_4_AUX_ISRC_TRIM_M                                       0x000000FC
#define ADI_4_AUX_ISRC_TRIM_S                                                2
#define ADI_4_AUX_ISRC_TRIM_11P75U                                  0x00000080
#define ADI_4_AUX_ISRC_TRIM_4P5U                                    0x00000040
#define ADI_4_AUX_ISRC_TRIM_2P0U                                    0x00000020
#define ADI_4_AUX_ISRC_TRIM_1P0U                                    0x00000010
#define ADI_4_AUX_ISRC_TRIM_0P5U                                    0x00000008
#define ADI_4_AUX_ISRC_TRIM_0P25U                                   0x00000004
#define ADI_4_AUX_ISRC_TRIM_NC                                      0x00000000

// Field:     [0] EN
//
// Current source enable
#define ADI_4_AUX_ISRC_EN                                           0x00000001
#define ADI_4_AUX_ISRC_EN_M                                         0x00000001
#define ADI_4_AUX_ISRC_EN_S                                                  0

//*****************************************************************************
//
// Register: ADI_4_AUX_O_COMP
//
//*****************************************************************************
// Field:     [7] COMPA_REF_RES_EN
//
// Enables 400kohm resistance from COMPA reference node to ground. Used with
// COMPA_REF_CURR_EN to generate voltage reference for cap-sense.
#define ADI_4_AUX_COMP_COMPA_REF_RES_EN                             0x00000080
#define ADI_4_AUX_COMP_COMPA_REF_RES_EN_M                           0x00000080
#define ADI_4_AUX_COMP_COMPA_REF_RES_EN_S                                    7

